# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeomCombinationSet..::..Insert Method
GeomCombinationSet Class See Also
---
Insert the specified element into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	GeomCombination item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As GeomCombination _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	GeomCombination^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..GeomCombinationThe GeomCombination to be inserted into the set.
# ### Return Value
Returns whether the GeomCombination was inserted into the set.
# See Also
GeomCombinationSet Class
Autodesk.Revit.DB Namespace